### 10 Minutes pour pandas

Voici une introduction à pandas,orientée principalement pour les nouveaux utilisateurs de cet outils.Vous pouvez plusieurs recettes complexes dans le livre de recette.

Habituellement,nous importons comme suit:

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Création d'un object

créer des séries en passant une list de valeurs, permettant  à pandas de créer un inder entier par défaut:

In [2]:
s =  pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Créer une trame de données en passant un numpy array,avec un index datetime et des colonnes étiquetées:

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4),index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.710657 -0.324506  1.539627  2.547298
2013-01-02 -0.752331  0.511833  0.822261  1.002391
2013-01-03  0.305880 -0.031585  0.303461  0.986025
2013-01-04 -0.213559  0.841170 -0.098138 -1.409066
2013-01-05  0.139133 -0.990651 -1.521375 -1.486217
2013-01-06 -1.241179  0.890609 -0.064618  1.180111

Création d'un DataFrame en passant un dictionnaire d'objets pouvant être convertis en séries:

In [6]:
df2 = pd.DataFrame({ 'A' : 1.,
                       'B' : pd.Timestamp('20130102'),
                         'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                         'D' : np.array([3] * 4,dtype='int32'),
                         'E' : pd.Categorical(["test","train","test","train"]),
                         'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Ayant des dtypes spécifiques :

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Si vous utilisez IPython,La fin des onglets pour les noms de colonnes (ainsi que les attributs publics) est automatiquement activée. Voici un sous-ensemble des attributs qui seront complétés:

In [8]:
df2.<TAB>

SyntaxError: invalid syntax (<ipython-input-8-e8d0e54abc86>, line 1)

### Viewing Data

Regardez le début et la fin de la rangés des trames:

In [9]:
df.head()

                   A         B         C         D
2013-01-01  0.710657 -0.324506  1.539627  2.547298
2013-01-02 -0.752331  0.511833  0.822261  1.002391
2013-01-03  0.305880 -0.031585  0.303461  0.986025
2013-01-04 -0.213559  0.841170 -0.098138 -1.409066
2013-01-05  0.139133 -0.990651 -1.521375 -1.486217

Afficher les index,colonnes et les numpy data sous-jacentes:

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.values

array([[ 0.71065659, -0.32450645,  1.53962654,  2.54729757],
       [-0.75233149,  0.51183264,  0.82226059,  1.00239099],
       [ 0.30588019, -0.03158451,  0.30346096,  0.98602478],
       [-0.21355899,  0.84116978, -0.09813798, -1.40906629],
       [ 0.13913334, -0.9906513 , -1.52137453, -1.48621694],
       [-1.24117924,  0.89060876, -0.06461805,  1.18011063]])

Décrire les résultats avec un rapide résumé statistique des données

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.175233  0.149478  0.163536  0.470090
std    0.719145  0.737069  1.030201  1.595420
min   -1.241179 -0.990651 -1.521375 -1.486217
25%   -0.617638 -0.251276 -0.089758 -0.810294
50%   -0.037213  0.240124  0.119421  0.994208
75%    0.264193  0.758835  0.692561  1.135681
max    0.710657  0.890609  1.539627  2.547298

Transposer les données

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.710657   -0.752331    0.305880   -0.213559    0.139133   -1.241179
B   -0.324506    0.511833   -0.031585    0.841170   -0.990651    0.890609
C    1.539627    0.822261    0.303461   -0.098138   -1.521375   -0.064618
D    2.547298    1.002391    0.986025   -1.409066   -1.486217    1.180111

Tri par axes

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  2.547298  1.539627 -0.324506  0.710657
2013-01-02  1.002391  0.822261  0.511833 -0.752331
2013-01-03  0.986025  0.303461 -0.031585  0.305880
2013-01-04 -1.409066 -0.098138  0.841170 -0.213559
2013-01-05 -1.486217 -1.521375 -0.990651  0.139133
2013-01-06  1.180111 -0.064618  0.890609 -1.241179

Tri par valeurs

In [17]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.139133 -0.990651 -1.521375 -1.486217
2013-01-01  0.710657 -0.324506  1.539627  2.547298
2013-01-03  0.305880 -0.031585  0.303461  0.986025
2013-01-02 -0.752331  0.511833  0.822261  1.002391
2013-01-04 -0.213559  0.841170 -0.098138 -1.409066
2013-01-06 -1.241179  0.890609 -0.064618  1.180111

### Selection

####Obtention

Sélection d'une seule colonne, qui donne une série, équivalent à df.A

In [18]:
df['A']

2013-01-01    0.710657
2013-01-02   -0.752331
2013-01-03    0.305880
2013-01-04   -0.213559
2013-01-05    0.139133
2013-01-06   -1.241179
Freq: D, Name: A, dtype: float64

Selection via []qui tranche les rangées

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  0.710657 -0.324506  1.539627  2.547298
2013-01-02 -0.752331  0.511833  0.822261  1.002391
2013-01-03  0.305880 -0.031585  0.303461  0.986025

In [20]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.752331  0.511833  0.822261  1.002391
2013-01-03  0.305880 -0.031585  0.303461  0.986025
2013-01-04 -0.213559  0.841170 -0.098138 -1.409066

####Selection par label

Pour obtenir une coupe transversale à l'aide d'un label

In [21]:
df.loc[dates[0]]

A    0.710657
B   -0.324506
C    1.539627
D    2.547298
Name: 2013-01-01 00:00:00, dtype: float64

Selection par label sur plusieurs axes

In [22]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.710657 -0.324506
2013-01-02 -0.752331  0.511833
2013-01-03  0.305880 -0.031585
2013-01-04 -0.213559  0.841170
2013-01-05  0.139133 -0.990651
2013-01-06 -1.241179  0.890609

Affichage du découpage de label, les deux extrémités sont incluses

In [23]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.752331  0.511833
2013-01-03  0.305880 -0.031585
2013-01-04 -0.213559  0.841170

Réduction des dimensions de l'objet retourné

In [24]:
df.loc['20130102',['A','B']]

A   -0.752331
B    0.511833
Name: 2013-01-02 00:00:00, dtype: float64

Pour obtenir une valeur scalaire

In [26]:
df.loc[dates[0],'A']

0.71065659135623394

Pour obtenir un accès rapide à un scalaire (équivaut à la méthode antérieure)

In [25]:
df.at[dates[0],'A']

0.71065659135623394

####Selecton par position

Selectionner via la position des entiers passés

In [27]:
df.iloc[3]

A   -0.213559
B    0.841170
C   -0.098138
D   -1.409066
Name: 2013-01-04 00:00:00, dtype: float64

Par tranches entières, agissant comme numpy / python

In [28]:
 df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.213559  0.841170
2013-01-05  0.139133 -0.990651

Par des listes d'emplacements de positions entières, semblables au style numpy / python

In [29]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.752331  0.822261
2013-01-03  0.305880  0.303461
2013-01-05  0.139133 -1.521375

Pour trancher des lignes explicitement

In [30]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.752331  0.511833  0.822261  1.002391
2013-01-03  0.305880 -0.031585  0.303461  0.986025

Pour couper des colonnes explicitement

In [31]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.324506  1.539627
2013-01-02  0.511833  0.822261
2013-01-03 -0.031585  0.303461
2013-01-04  0.841170 -0.098138
2013-01-05 -0.990651 -1.521375
2013-01-06  0.890609 -0.064618

Pour obtenir une valeur explicitement

In [32]:
df.iloc[1,1]

0.51183263867660023

Pour obtenir un accès rapide à un scalaire (équivaut à la méthode antérieure)

In [33]:
df.iat[1,1]

0.51183263867660023

####Indexation booléenne

Utilisation des valeurs d'une seule colonne pour sélectionner des données.

 df[df.A > 0]

In [35]:
 df[df > 0]

                   A         B         C         D
2013-01-01  0.710657       NaN  1.539627  2.547298
2013-01-02       NaN  0.511833  0.822261  1.002391
2013-01-03  0.305880       NaN  0.303461  0.986025
2013-01-04       NaN  0.841170       NaN       NaN
2013-01-05  0.139133       NaN       NaN       NaN
2013-01-06       NaN  0.890609       NaN  1.180111

Utilisation de la méthode isin () pour le filtrage:

In [36]:
df2 = df.copy()

In [37]:
df2['E'] = ['one', 'one','two','three','four','three']

In [38]:
df2

                   A         B         C         D      E
2013-01-01  0.710657 -0.324506  1.539627  2.547298    one
2013-01-02 -0.752331  0.511833  0.822261  1.002391    one
2013-01-03  0.305880 -0.031585  0.303461  0.986025    two
2013-01-04 -0.213559  0.841170 -0.098138 -1.409066  three
2013-01-05  0.139133 -0.990651 -1.521375 -1.486217   four
2013-01-06 -1.241179  0.890609 -0.064618  1.180111  three

In [39]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.305880 -0.031585  0.303461  0.986025   two
2013-01-05  0.139133 -0.990651 -1.521375 -1.486217  four

####Setting

La définition d'une nouvelle colonne aligne automatiquement les données par les index

In [40]:
 s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [41]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

Définition des valeurs par libellé

In [43]:
df.at[dates[0],'A'] = 0

Définition des valeurs par position

In [44]:
In [49]: df.iat[0,1] = 0

Réglage par assignation avec un tableau numpy

In [45]:
df.loc[:,'D'] = np.array([5] * len(df))

Le résultat des opérations de réglage préalable

In [46]:
 df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.539627  5  NaN
2013-01-02 -0.752331  0.511833  0.822261  5  1.0
2013-01-03  0.305880 -0.031585  0.303461  5  2.0
2013-01-04 -0.213559  0.841170 -0.098138  5  3.0
2013-01-05  0.139133 -0.990651 -1.521375  5  4.0
2013-01-06 -1.241179  0.890609 -0.064618  5  5.0

In [47]:
df2 = df.copy()

In [48]:
df2[df2 > 0] = -df2

In [49]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.539627 -5  NaN
2013-01-02 -0.752331 -0.511833 -0.822261 -5 -1.0
2013-01-03 -0.305880 -0.031585 -0.303461 -5 -2.0
2013-01-04 -0.213559 -0.841170 -0.098138 -5 -3.0
2013-01-05 -0.139133 -0.990651 -1.521375 -5 -4.0
2013-01-06 -1.241179 -0.890609 -0.064618 -5 -5.0

### Données manquantes

Pandas utilise principalement la valeur np.nan pour représenter les données manquantes. Il est par défaut non inclus dans les calculs.
La réinitialisation vous permet de modifier / ajouter / supprimer l'index sur un axe spécifié. Cela retourne une copie des données:

In [50]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [51]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [52]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.539627  5  NaN  1.0
2013-01-02 -0.752331  0.511833  0.822261  5  1.0  1.0
2013-01-03  0.305880 -0.031585  0.303461  5  2.0  NaN
2013-01-04 -0.213559  0.841170 -0.098138  5  3.0  NaN

Pour supprimer les lignes dont les données manquent.

In [53]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.752331  0.511833  0.822261  5  1.0  1.0

Remplir les données manquantes

In [54]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.539627  5  5.0  1.0
2013-01-02 -0.752331  0.511833  0.822261  5  1.0  1.0
2013-01-03  0.305880 -0.031585  0.303461  5  2.0  5.0
2013-01-04 -0.213559  0.841170 -0.098138  5  3.0  5.0

Pour obtenir le masque booléen où les valeurs sont nan

In [55]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

### Opérations

####stats

Les opérations en général excluent les données manquantes.

Effectuer une statistique descriptive

In [56]:
df.mean()

A   -0.293676
B    0.203563
C    0.163536
D    5.000000
F    3.000000
dtype: float64

Même opération sur l'autre axe

In [57]:
df.mean(1)

2013-01-01    1.634907
2013-01-02    1.316352
2013-01-03    1.515551
2013-01-04    1.705895
2013-01-05    1.325422
2013-01-06    1.916962
Freq: D, dtype: float64

Fonctionnement avec des objets qui ont une dimension différente et ont besoin d'alignement. En outre, les pandas diffusent automatiquement le long de la dimension spécifiée

In [58]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [59]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [60]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.694120 -1.031585 -0.696539  4.0  1.0
2013-01-04 -3.213559 -2.158830 -3.098138  2.0  0.0
2013-01-05 -4.860867 -5.990651 -6.521375  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

####Application

Appliquer les fonctions sur les données

In [61]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  1.539627   5   NaN
2013-01-02 -0.752331  0.511833  2.361887  10   1.0
2013-01-03 -0.446451  0.480248  2.665348  15   3.0
2013-01-04 -0.660010  1.321418  2.567210  20   6.0
2013-01-05 -0.520877  0.330767  1.045836  25  10.0
2013-01-06 -1.762056  1.221375  0.981218  30  15.0

In [62]:
df.apply(lambda x: x.max() - x.min())

A    1.547059
B    1.881260
C    3.061001
D    0.000000
F    4.000000
dtype: float64

####Histogramme

In [63]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [64]:
s

0    0
1    2
2    6
3    0
4    0
5    0
6    1
7    4
8    4
9    2
dtype: int32

In [65]:
s.value_counts()

0    4
4    2
2    2
6    1
1    1
dtype: int64

####Méthodes string

Series est équipé d'un ensemble de méthodes de traitement de chaîne dans l'attribut str qui le rendent facile à utiliser sur chaque élément du tableau, comme dans l'extrait de code ci-dessous. Notez que le pattern-matching dans str utilise généralement des expressions régulières par défaut (et dans certains cas les utilise toujours).

In [66]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [67]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

####Fusionner

#####Concat

Pandas offre diverses facilités pour combiner facilement des objets Series, DataFrame et Panel avec différents types de logique de consigne pour les index et la fonctionnalité d'algèbre relationnelle dans le cas d'opérations de type join / merge.
Concaténation des objets pandas avec concat ():

In [68]:
df = pd.DataFrame(np.random.randn(10, 4))

In [69]:
df

          0         1         2         3
0 -0.421398 -1.124737 -0.953439  1.344613
1 -0.833319 -0.932216 -1.096239 -0.268687
2 -0.126676  1.368458 -1.130224  0.676650
3  1.285273 -0.361923  0.609331  0.946548
4  0.503251  0.459209 -0.048707 -1.194623
5 -0.239446  0.428496  0.139438  1.046312
6  0.177540 -0.309093 -1.122195  0.949633
7  0.089126  2.175735 -2.414000  1.890943
8  0.007935 -0.851761  1.550063 -0.130943
9 -0.782365  0.004162  0.192006 -1.973330

In [70]:
pieces = [df[:3], df[3:7], df[7:]]

In [71]:
pd.concat(pieces)

          0         1         2         3
0 -0.421398 -1.124737 -0.953439  1.344613
1 -0.833319 -0.932216 -1.096239 -0.268687
2 -0.126676  1.368458 -1.130224  0.676650
3  1.285273 -0.361923  0.609331  0.946548
4  0.503251  0.459209 -0.048707 -1.194623
5 -0.239446  0.428496  0.139438  1.046312
6  0.177540 -0.309093 -1.122195  0.949633
7  0.089126  2.175735 -2.414000  1.890943
8  0.007935 -0.851761  1.550063 -0.130943
9 -0.782365  0.004162  0.192006 -1.973330

#####Join

In [72]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [73]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [74]:
left

   key  lval
0  foo     1
1  foo     2

In [75]:
right

   key  rval
0  foo     4
1  foo     5

In [76]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

un autre exemple:

In [77]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [78]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [79]:
left

   key  lval
0  foo     1
1  bar     2

In [80]:
right

   key  rval
0  foo     4
1  bar     5

In [81]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [ ]:
#####Append

In [82]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [83]:
df

          A         B         C         D
0  0.650738  0.360153 -0.592060  0.881652
1  1.246683  0.276717  0.207103  0.533673
2 -0.244993  1.272207  1.298324  0.647567
3  0.610493  0.511755 -0.074207 -1.202234
4  1.435150 -0.323804  1.691301 -0.389938
5 -0.618866  1.622388 -0.214579 -0.470733
6 -1.163516 -1.578742  0.978725  0.105961
7  1.950032 -0.456740 -0.494363 -1.575629

In [84]:
s = df.iloc[3]

In [85]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.650738  0.360153 -0.592060  0.881652
1  1.246683  0.276717  0.207103  0.533673
2 -0.244993  1.272207  1.298324  0.647567
3  0.610493  0.511755 -0.074207 -1.202234
4  1.435150 -0.323804  1.691301 -0.389938
5 -0.618866  1.622388 -0.214579 -0.470733
6 -1.163516 -1.578742  0.978725  0.105961
7  1.950032 -0.456740 -0.494363 -1.575629
8  0.610493  0.511755 -0.074207 -1.202234

####Groupement


Par "group by", on entend un processus impliquant une ou plusieurs des étapes suivantes:
• Diviser les données en groupes en fonction de certains critères
• Appliquer une fonction à chaque groupe indépendamment
• Combiner les résultats dans une structure de données

In [86]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                             'foo', 'bar', 'foo', 'foo'],
                      'B' : ['one', 'one', 'two', 'three',
                             'two', 'two', 'one', 'three'],
                      'C' : np.random.randn(8),
                      'D' : np.random.randn(8)})

In [87]:
df

     A      B         C         D
0  foo    one -0.219771  0.484829
1  bar    one  0.018204  0.393043
2  foo    two -1.129702  0.172558
3  bar  three  1.569955 -1.521704
4  foo    two  0.018424 -0.238926
5  bar    two  0.234405  0.408707
6  foo    one -1.326029  0.552174
7  foo  three -0.237122  0.495051

Regroupement puis application d'une somme de fonction aux groupes résultants.

In [88]:
df.groupby('A').sum()

            C         D
A
bar  1.822564 -0.719954
foo -2.894201  1.465686

Le regroupement par plusieurs colonnes forme un index hiérarchique, que nous appliquons ensuite à la fonction

In [89]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.018204  0.393043
    three  1.569955 -1.521704
    two    0.234405  0.408707
foo one   -1.545801  1.037003
    three -0.237122  0.495051
    two   -1.111278 -0.066368

####Remodelage

#####Empiler

In [91]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                      ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))

In [92]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [93]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [94]:
df2 = df[:4]

In [95]:
df2

                     A         B
first second
bar   one    -0.030650  2.481089
      two    -0.090334 -0.282893
baz   one    -2.458160  0.228546
      two     0.309626  0.533467

La méthode stack () "compresse" un niveau dans les colonnes du DataFrame.

In [96]:
stacked = df2.stack()

In [97]:
stacked

first  second
bar    one     A   -0.030650
               B    2.481089
       two     A   -0.090334
               B   -0.282893
baz    one     A   -2.458160
               B    0.228546
       two     A    0.309626
               B    0.533467
dtype: float64

Avec un DataFrame ou une série "empilés" (ayant un index MultiIndex), l'opération inverse de stack () est unstack (), qui désempile par défaut le dernier niveau:

In [98]:
stacked.unstack()

                     A         B
first second
bar   one    -0.030650  2.481089
      two    -0.090334 -0.282893
baz   one    -2.458160  0.228546
      two     0.309626  0.533467

In [99]:
stacked.unstack(1)

second        one       two
first
bar   A -0.030650 -0.090334
      B  2.481089 -0.282893
baz   A -2.458160  0.309626
      B  0.228546  0.533467

In [100]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.030650 -2.458160
       B  2.481089  0.228546
two    A -0.090334  0.309626
       B -0.282893  0.533467

#####Tableaux pivotants

In [101]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                      'B' : ['A', 'B', 'C'] * 4,
                     'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D' : np.random.randn(12),
                     'E' : np.random.randn(12)})

In [102]:
df

        A  B    C         D         E
0     one  A  foo  0.474095  0.051979
1     one  B  foo  0.086877  1.990424
2     two  C  foo -1.724199  0.913077
3   three  A  bar  0.386752 -0.016692
4     one  B  bar -0.216183 -0.407235
5     one  C  bar  0.844735 -0.578347
6     two  A  foo -0.469866  0.525087
7   three  B  foo -0.180602 -0.097839
8     one  C  foo -1.203473 -1.996498
9     one  A  bar -0.050480  0.916872
10    two  B  bar -1.668142 -1.522163
11  three  C  bar  1.265194  0.109080

Nous pouvons produire des tableaux croisés à partir de ces données très facilement:

In [103]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.050480  0.474095
      B -0.216183  0.086877
      C  0.844735 -1.203473
three A  0.386752       NaN
      B       NaN -0.180602
      C  1.265194       NaN
two   A       NaN -0.469866
      B -1.668142       NaN
      C       NaN -1.724199